// 차근차근 구현
let N = Int(readLine()!)!
let inp = Array(readLine()!)

var board: [[Character]] = []
for i in stride(from: 0, to: N, by: N/5) {
    board.append(Array(inp[i..<i+N/5]) + ["."])
}

//for b in board {
//    print(b)
//}

let book: [[[String]]] = [
    [
        ["#", "#", "#"],
        ["#", ".", "#"],
        ["#", ".", "#"],
        ["#", ".", "#"],
        ["#", "#", "#"],
    ],
    [
        ["#"],
        ["#"],
        ["#"],
        ["#"],
        ["#"],
    ],
    [
        ["#", "#", "#"],
        [".", ".", "#"],
        ["#", "#", "#"],
        ["#", ".", "."],
        ["#", "#", "#"],
    ],
    [
        ["#", "#", "#"],
        [".", ".", "#"],
        ["#", "#", "#"],
        [".", ".", "#"],
        ["#", "#", "#"],
    ],
    [
        ["#", ".", "#"],
        ["#", ".", "#"],
        ["#", "#", "#"],
        [".", ".", "#"],
        [".", ".", "#"],
    ],
    [
        ["#", "#", "#"],
        ["#", ".", "."],
        ["#", "#", "#"],
        [".", ".", "#"],
        ["#", "#", "#"],
    ],
    [
        ["#", "#", "#"],
        ["#", ".", "."],
        ["#", "#", "#"],
        ["#", ".", "#"],
        ["#", "#", "#"],
    ],
    [
        ["#", "#", "#"],
        [".", ".", "#"],
        [".", ".", "#"],
        [".", ".", "#"],
        [".", ".", "#"],
    ],
    [
        ["#", "#", "#"],
        ["#", ".", "#"],
        ["#", "#", "#"],
        ["#", ".", "#"],
        ["#", "#", "#"],
    ],
    [
        ["#", "#", "#"],
        ["#", ".", "#"],
        ["#", "#", "#"],
        [".", ".", "#"],
        ["#", "#", "#"],
    ],

]

func check(_ j: Int) -> String {

    if ((0..<5).map { board[$0][j] }.allSatisfy { $0 == "#" }) && ((0..<5).map { board[$0][j+1] }.allSatisfy { $0 == "." }) {
        return "1"
    }

    var temp = Array(repeating: Array(repeating: ".", count: 3), count: 5)
    for x in 0..<5 {
        for y in 0..<3 {
            temp[x][y] = String(board[x][y+j])
        }
    }


    return String(book.firstIndex(of: temp)!)
}

var result = ""
var j = 0
let width = board[0].count
while j < width-1 {
    if board[0][j] == "#" {
        let num = check(j)
        result += num

        if num == "1" {
            j += 1
        } else {
            j += 3
        }

    } else if board[0][j] == "." {
        j += 1
    }
}

print(result)
